In [1]:
import pandas as pd

In [4]:
data = pd.read_csv("beauty.csv", sep = ';')

In [8]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [10]:
data["wage"]

0        5.73
1        4.28
2        7.96
3       11.57
4       11.42
        ...
1255     1.61
1256     1.68
1257     3.29
1258     2.31
1259     1.92
Name: wage, Length: 1260, dtype: float64

In [11]:
data.loc[1:5,['wage','female']]

    wage  female
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [13]:
data.iloc[:,2:4]

      union  goodhlth
0         0         1
1         0         1
2         0         1
3         0         1
4         0         1
...     ...       ...
1255      0         1
1256      0         1
1257      0         1
1258      0         1
1259      0         0

[1260 rows x 2 columns]

In [24]:
data[data["female"] == 1]['wage'].mean(), \
data[data["female"] == 0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

In [33]:
data[(data["female"] == 0) & (data["married"] == 1)]['wage'].median()

6.710000000000001

In [49]:
for i, sub_df in data.groupby('looks'):
    print(i)
    print(sub_df['wage'].mean())

1
4.621538461538462
2
5.328802816901409
3
6.504598337950134
4
6.299340659340659
5
7.38842105263158

In [55]:
for i,sub in data.groupby("looks"):
    print(sub['wage'].head())

28      8.35
200     3.75
248    10.99
327     1.65
751     7.93
Name: wage, dtype: float64
12    5.14
33    8.17
35    9.62
37    7.69
57    6.56
Name: wage, dtype: float64
1     4.28
3    11.57
4    11.42
5     3.91
6     8.76
Name: wage, dtype: float64
0     5.73
2     7.96
7     7.69
10    3.45
11    4.03
Name: wage, dtype: float64
26     14.84
27     19.08
76     23.32
112     6.11
316     3.92
Name: wage, dtype: float64

In [56]:
pd.crosstab(data['female'],data['married'])

married    0    1
female
0        166  658
1        223  213

In [57]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [59]:
data['is_rich'] = data['wage'] > data['wage'].quantile(.75)

In [60]:
def string_gender(female):
    return 'female' if female else 'male'

In [61]:
data['female'].apply(string_gender)

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [62]:
data['female'].apply(lambda female: 'female' if female else 'male')

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [68]:
for i, sub in data.groupby('female'):
    print(i)
    print(sub['wage'].quantile(0.5))

0
6.41
1
3.75

In [76]:
print(data[data['female'] == 1]['wage'].median(),
      data[data['female'] == 0]['wage'].median())

3.75 6.41